Repository: NouhailaBouanane1/Alzheimer-Care-System-Application
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Language
ar: اللغة

source: Select your language
ar: اختر لغتك

source: Start
ar: بدء

source: Login or create account
ar: تسجيل الدخول أو الاشتراك

source: Take tests and play games.
ar: الإختبار والألعاب

source: Patient
ar: مريض

source: Caregiver
ar: مرافق

source: Doctor
ar: طبيب

source: Settings
ar: إعدادات

source: Email
ar: البريد الإلكتروني

source: Forget password
ar: نسيت كلمة السر

source: Login Successful
ar: تم تسجيل الدخول بنجاح

source: Select profile picture
ar: قم بإختيار صورة للبروفايل

source: Camera
ar: كاميرا

source: Gallery
ar: عرض الصور

source: First Name cannot be Empty
ar: لا يمكن للإسم الشخصي أن يكون فارغ

# validName
source: Enter Valid name(Min. 3 Character)
ar: الإسم يجب أن يتكون من 3 حروف على الأقل

source: Second Name cannot be Empty
ar: لا يمكن للإسم العائلي أن يكون فارغ

source: Please Enter Your Email
ar: المرجو إدخال بريدك الإلكتروني

# validEmail
source: Please Enter a valid email
ar: المرجو إدخال بريد إلكتروني صحيح

source: Password
ar: كلمة السر

# passwordRequired
source: Password is required
ar: يجب إدخال كلمة السر

# currentPassword
source: Enter Current Password
ar: أدخل كلمة السر الحالية

# numOfCharInPass
source: Enter Valid Password(Min. 6 Character)
ar: يجب إدخال كلمة سر تتكون من 6 حروف على الأقل

# passMatch
source: Password don't match
ar: كلمة السر مختلفه

source: Account created successfully :)
ar: لقد تم إنشاء الحساب :)

# enterNewPass
source: Enter New Password
ar: قم بإدخال كلمة سر جديدة

source: Sign In
ar: تسجيل الدخول

# screen2Paragraph
source: Alzheimer's Care System is a mobile application that is used in order to help Alzheimer's patients. It is also to facilitate interaction between doctors, caregivers, and patients.
ar: تطبيق نظام رعاية مرضى الزهايمر هو تطبيق للهاتف المحمول يستخدم لمساعدة مرضى الزهايمر. كما أنه يسهل التفاعل بين الأطباء ومقدمي الرعاية والمرضى.

source: Sign Up
ar: اشتراك

# dontHaveAccount
source: Don't have an account
ar: ليس لديك حساب

source: Reset Password
ar: إعادة تعيين كلمة السر

source: First name
ar: الاسم الأول

source: Second name
ar: الإسم العائلي

source: Confirm password
ar: تأكيد كلمة المرور

# changePass
source: Change Password
ar: تغيير كلمة السر

source: you win
ar: فزت

source: Close
ar: إغلاق

source: Move
ar: تحريك

# addDoctor
source: Add a Doctor
ar: إضافة طبيب

# addCaregiver
source: Add a Caregiver
ar: إضافة مرافق

source: Skip
ar: تخطى

source: Test and Games
ar: الاختبار والألعاب

source: Test
ar: الاختبار

source: Games
ar: الألعاب

source: My Daily Activities
ar: نشاطاتي اليومية

source: My Location
ar: موقعي

# tapDownToShareLocation
source: Tap down on the map to Share your Location
ar: إظغط أسفل الخريطة لتحديد موقعك

# noPatientToBeDisplayed
source: There is no patients to be displayed
ar: لا يوجد مرضى ليتم عرضهم

# enterEmailToResetPass
source: Enter your email below to reset your password
ar: قم بإدخال بريدك الإلكتروني بالأسفل ليتم إسترجاع كلمة السر

source: Send Request
ar: ابعث طلب

source: Request
ar: طلب الإضافة

source: Delete
ar: حذف

source: Accept
ar: وافق

source: Edit
ar: تعديل

# noRequest
source: No requests yet
ar: لا توجد طلبات إضافة

# errorOccuredTryLater
source: An error occurred please try again later
ar: حدث خطأ جرب في وقت أخر

source: Points
ar: علامة

source: Replay
ar: إعادة

source: Exit
ar: خروج

source: wrong choice
ar: خيار خاطئ

# passHasBeenChanged
source: Your Password has been changed....Login again
ar: لقد تم تغيير كلمة السر قم بتسجيل الدخول مرة أخرى

source: Drugs
ar: الأدوية

source: To Do List
ar: قائمة المهام

source: Flipping cards
ar: لعبة بطاقة التقليب

source: Sliding Puzzle
ar: لعبة انزلاق اللغز

source: Tic Tac Toe
ar: لعبة تيك تاك تو

source: Notification
ar: إشعارات

source: Emergency
ar: طوارئ

source: Fast Messages
ar: رسائل سريعة

# chatrequest
source: Chat and Requests
ar: المحادثات وطلبات الإضافة

source: Proof of life
ar: دليل على الحياة

source: Share Location
ar: مشاركة الموقع

source: About You
ar: عن نفسك

source: Memories
ar: ذكريات

# favorites
source: Favorite Places
ar: الأماكن المفضلة

# learnAboutAlz
source: About Alzheimer
ar: تعرف على الزهايمر

source: Chatbot
ar: روبوت الدردشة

source: Account
ar: الحساب

source: Change Password
ar: تغيير كلمة السر

source: SIGN OUT
ar: تسجيل الخروج

source: My Favorite Places
ar: أماكني المفضلة

source: Choose a Game
ar: إختار واحدة من الألعاب

source: Discover More Games
ar: إكتشف ألعاب أكثر

source: No Drugs yet
ar: لا عقاقير بعد

source: No Tasks yet
ar: ليست هناك مهام حتى الآن

source: Add Task
ar: إضافة مهمة

source: Confirm
ar: تأكيد

source: Drug List
ar: قائمة الأدوية

source: Tasks
ar: مهام

source: ToDayDo
ar: مهام اليوم

source: Call me
ar: اتصل بي

source: What is my next pill?
ar: ماهو الدواء القادم؟

# yourNextPill
source: Your're next pill is:
ar: دوائك القادم :

# youDontHaveAnyPill
source: You don't need to take any pill yet!
ar: لا يوجد لديك دواء قادم

# findWayToHome
source: I can't find my way home
ar: لا استطيع تذكر موقع البيت

source: I am good
ar: انا في حالة جيدة

source: I will sleep
ar: سأخلد للنوم

source: Images
ar: الصور

source: Videos
ar: فيديو

source: Places
ar: الأماكن

source: Colors
ar: الألوان

source: Food
ar: الأكلات

source: Drinks
ar: المشروبات

source: Alzheimer Care System
ar: نظام رعاية مرضى الزهايمر

# sharedLocationPatient
source: No patients have shared their location yet!
ar: لم يشارك أي مريض موقعه حتى الآن!!

# q1
source: What level of memory loss is the individual experiencing?
ar: ما هو مستوى فقدان الذاكرة الذي يعاني منه الفرد؟

# q1Ans1
source: No loss of memory or sporadic forgetfulness.
ar: لا توجد أعراض لفقدان الذاكرة أو النسيان المتقطع.

# q1Ans2
source: Consistent forgetfulness and partial recollection of events (which they may have fully recollected in the past).
ar: النسيان المستمر والتذكر الجزئي للأحداث (التي ربما كان الشخص يتذكرها بالكامل في الماضي).

# q1Ans3
source: Moderate memory loss that impacts recent events more severely than distant memories. Memory loss impacts daily activities.
ar: فقدان الذاكرة المعتدل الذي يؤثر على الأحداث الأخيرة بشكل أكثر من الذكريات البعيدة. يؤثر فقدان الذاكرة على الأنشطة اليومية.

# q1Ans4
source: Severe memory loss, recollection of recent events limited, long term memories may be retained but incomplete.
ar: فقدان الذاكرة الشديد ، وتذكر الأحداث الأخيرة محدود ، والذكريات طويلة المدى قد يتم تذكرها ولكنها غير مكتملة.

# q1Ans5
source: Severe memory loss, almost no recollection of recent events and highly fragmented long-term memory.
ar: فقدان الذاكرة الشديد وعدم تذكر الأحداث الأخيرة تقريبًا والذاكرة طويلة المدى شديدة التجزئة.

# q2
source: What level of time and geographic disorientation is the individual experiencing?
ar: ما مدى نسيان الشخص للوقت والأماكن؟

# q2Ans1
source: No disorientation.
ar: لا ينسى.

# q2Ans2
source: Minor difficulty with time relationships (such as the order of events or distortion of fixed time periods such as minutes, hours or an afternoon).
ar: صعوبات طفيفة في تذكر الوقت (مثل ترتيب الأحداث أو الفترات الزمنية المحددة مثل الدقائق أو الساعات ).

# q2Ans3
source: Moderate difficulty with time relationships and occasional geographic disorientation (such as getting lost within an area well-known to the person).
ar: صعوبة معتدلة في تذكر الوقت والأماكن (مثل الضياع في منطقة معروفة لدى الشخص).

# q2Ans4
source: Severe difficulty with time relationships; disoriented to time and place on a daily basis.
ar: صعوبة شديدة في تذكر الوقت والأماكن بشكل يومي.

# q2Ans5
source: Oriented to present moment only or to their present moment.
ar: ينبغي توجيه الشخص من طرف شخص أخر.

# q3
source: Is the individual having challenges with judgement and product solving?
ar: هل يواجه الفرد تحديات في الحكم وحل المشاكل؟

# q3Ans1
source: Shows no diminished ability in handling problems, business and financial affairs.
ar: لا يظهر الشخص أعراض على عدم القدرة على التعامل مع المشاكل.

# q3Ans2
source: Shows minor impairment in judgment and with solving problems relative to past performance on similar tasks.
ar: يُظهر ضعفًا طفيفًا في الحكم وحل المشكلات المتعلقة بمهام تم القيام بها من قبل.

# q3Ans3
source: Has moderate difficulty in handling problems, may show occasional social judgment issues.
ar: لديه صعوبة معتدلة في التعامل مع المشكلات ، وقد تظهر عليه مشكلات في الحكم على الأمور.

# q3Ans4
source: Has severe difficulty in handling problems and presents persistent social judgment issues.
ar: يعاني من صعوبة شديدة في التعامل مع المشكلات.

# q3Ans5
source: Completely unable to make judgments or solve problems.
ar: غير قادر تمامًا على إصدار أحكام أو حل المشكلات.

# q4
source: How does the individual function in their community, outside of their home?
ar: كيف يعمل الشخص في مجتمعه ، خارج منزله؟

# q4Ans1
source: They function independently continuing to shop, volunteer and socialize as they have in the past.
ar: يعمل بشكل مستقل ويستمر في التسوق والتطوع والتواصل الاجتماعي كما كان في الماضي.

# q4Ans2
source: They show slight impairment in shopping and socializing but can do so with minor assistance.
ar: يظهر ضعفًا طفيفًا في التسوق والتواصل الاجتماعي ولكن يمكنه القيام بذلك بمساعدة بسيطة.

# q4Ans3
source: Unable to function independently outside the home but can appear normal to a casual observer.
ar: غير قادر على العمل بشكل مستقل خارج المنزل ولكن يمكن أن يبدو طبيعيًا للمراقب العادي.

# q4Ans4
source: Unable to function independently outside the home but functions well enough to be taken to some functions.
ar: غير قادر على العمل بشكل مستقل خارج المنزل ولكنه يعمل بشكل جيد بما يكفي لأداء بعض الوظائف.

# q4Ans5
source: Cannot be taken outside the home without constant monitoring.
ar: لا يمكن اصطحابه خارج المنزل دون مراقبة مستمرة.

# q5
source: How does the individual function within their home with chores and hobbies? (Do not consider personal hygiene in this question).
ar: كيف يعمل الشخص داخل منزله بالنسبة للأعمال المنزلية والهوايات؟ (لا تضع في اعتبارك النظافة الشخصية في هذا السؤال).

# q5Ans1
source: They continue to complete in-home chores, pursue hobbies and maintain interests as they have always done.
ar: يستطيع إكمال الأعمال المنزلية وممارسة الهوايات والحفاظ على الاهتمامات كما كان يفعل دائمًا.

# q5Ans2
source: They continue to perform chores and pursue interests but with some challenges due to cognitive issues.
ar: يستمر في أداء الأعمال المنزلية ومتابعة الهوايات ولكن مع بعض التحديات في التعرف على الأشياء.

# q5Ans3
source: They have given up performing more complex chores and interests but still pursue simpler ones.
ar: تخل عن أداء الأعمال الأكثر تعقيدًا ولكن لا زال يسعى وراء الأعمال البسيطة.

# q5Ans4
source: They can perform only simple chores and may not do so correctly.
ar: يمكنه فقط أداءالأعمال المنزلية البسيطة وقد لا يقوم بذلك بشكل صحيح.

# q5Ans5
source: They have no significant function within the home.
ar: يحتاج إلى مساعدة يومية في الأعمال المنزلية.

# q6
source: What level of personal hygiene and personal care does the individual maintain?
ar: ما هو مستوى النظافة الشخصية والعناية الشخصية التي يحافظ عليها الشخص؟

# q6Ans1
source: They are fully capable of self-care and do so without prompting.
ar: قادر على الإعتناء بنفسه بشكل تام ويقوم بذلك دون مساعدة.

# q6Ans2
source: They are fully capable of self-care
ar: قادرعلى الرعاية الذاتية بشكل تام .

# q6Ans3
source: They are capable of self-care but may require the occasional prompt and assistance with clothing decisions.
ar: قادر على الرعاية الذاتية ولكن قد يحتاج إلى مساعدة فورية في اتخاذ قرارات تتعلق بالملابس.

# q6Ans4
source: They require significant assistance with self-care, frequent prompting and have difficulty keeping track of their personal effects.
ar: يحتاج إلى مساعدة كبيرة في الرعاية الذاتية.

# q6Ans5
source: They require daily assistance with hygiene, personal care and are frequently incontinent.
ar: يحتاج إلى مساعدة يومية في النظافة والعناية الشخصية وغالبًا ما يعاني من سلس البول.

# res1
source: Based on your answers and the CDR-SOB scale, the individual has no cognitive impairment.!
ar: بناءً على إجاباتك ومقياس CDR-SOB ، لا يعاني الفرد من ضعف إدراكي.!

# res2
source: Based on your answers and the CDR-SOB scale, the individual has a questionable or very mild dementia!
ar: بناءً على إجاباتك ومقياس CDR-SOB ، يعاني الفرد من أعراض خرف مشكوك فيه أو خفيف جدًا!

# res3
source: Based on your answers and the CDR-SOB scale, the individual has mild dementia!
ar: بناءً على إجاباتك ومقياس CDR-SOB ، يعاني الفرد من الخرف الخفيف!

# res4
source: Based on your answers and the CDR-SOB scale, the individual has moderate dementia!
ar: بناءً على إجاباتك ومقياس CDR-SOB ، فإن الفرد يعاني من المراحل المتوسطة للخرف

# res5
source: Based on your answers and the CDR-SOB scale, the individual has severe dementia!
ar: بناءً على إجاباتك ومقياس CDR-SOB ، فإن الفرد يعاني من الخرف الشديد!

source: Welcome
ar: أهلا بك

# getStarted
source: LET'S GET STARTED
ar: لنبدأ

source: Restart Quiz!
ar: إعادة تشغيل الاختبار!

source: Drug Reminder
ar: التذكير بالأدوية

source: Users List
ar: قائمة المستخدمين

source: there's no patient to be displayed
ar: لا يوجد مريض ليتم عرضه

source: Patient to Do List
ar: قائمة المهام

source: Chat
ar: محادثة

source: Requests
ar: طلب إضافة

source: No Requests yet
ar: لا توجد طلبات حتى الآن

source: New Reminder
ar: تذكير جديد

source: Medicine name
ar: إسم الدواء

source: Type
ar: نوع

source: Schedule Time
ar: الجدول الزمني

source: Duration
ar: مدة

source: Use it for 3 month
ar: استخدمه لمدة 3 أشهر

source: Set
ar: إضافة

source: Patient Disease History
ar: تاريخ مرض المريض

source: Patient Drugs
ar: ادوية المرضى

source: Play
ar: بدء اللعب

source: Restart
ar: اعادة البدء

# playVideo
source: Video Play
ar: تشغيل الفيديو

source: Loading
ar: تحميل

source: Video saved
ar: تم حفظ الفيديو

source: Save
ar: حفظ

source: Drugs Reminder
ar: تذكير بالأدوية

source: Panadol
ar: باندول

source: Image saved
ar: تم حفظ الصورة

# addPlaces
source: Add a place
ar: أضف مكانًا

source: Press to Restart the Game
ar: اضغط لإعادة تشغيل اللعبة

# noNotes
source: You have not added any notes yet!
ar: لم تقم بإضافة أية ملاحظات حتى الآن!

# addNote
source: Add a Note
ar: أضف ملاحظة

source: Set Reminder
ar: تعيين التذكير

source: Drops
ar: قطرات

source: Capsules
ar: كبسولات

source: Liquid
ar: سائل

source: ointment
ar: مرهم

source: Files
ar: الملفات

source: Your Notes
ar: ملاحظاتك

source: Add
ar: إضافة

source: Send
ar: إرسال

# writeYourMessage
source: Write your message here....
ar: اكتب رسالتك هنا....

source: Player
ar: لاعب

source: Undecided Game
ar: لعبة غير مقررة

source: Won
ar: فاز

# moreQuestion
source: We have more questions!
ar: يوجد المزيد من الأسئلة!

# noMoreQuestion
source: We have more questions!
ar: يوجد المزيد من الأسئلة!
